app/controllers/employers_controller.rb

INSERT INTO `employers` (`name`, `gender`, `location`, `password_digest`, `created_at`, `updated_at`) VALUES ('madhav', 1, 'kakatil', '$2a$10$KJITx7cbweluekZuOTS.AeKtWCDAFeKTbNZNWSQYnTJ/bkJRgi51u', '2017-03-23 16:06:24', '2017-03-23 16:06:24')
---
  def create
    @employer = Employer.new(employer_params)
    if @employer.save

SELECT  `employers`.* FROM `employers` WHERE `employers`.`id` = 5 LIMIT 1
---
  def edit
    @employer= Employer.find(params[:id])

SELECT  `employers`.* FROM `employers` WHERE `employers`.`id` = 1 LIMIT 1
UPDATE `employers` SET `location` = 'bangalorea', `gender` = 0, `updated_at` = '2017-03-26 17:01:12' WHERE `employers`.`id` = 1
---
  def update
    @employer = Employer.find(params[:id])
    if @employer.update_attributes(employer_params)

SELECT  "employers".* FROM "employers" WHERE "employers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @employer = Employer.find(params[:id] || current_employer.id)

SELECT  `employers`.* FROM `employers` INNER JOIN `emails` ON `emails`.`employer_id` = `employers`.`id` WHERE `emails`.`confirm_token` = 'ytAlrlJNW8QldMg6Q_OYfw' ORDER BY `employers`.`id` ASC LIMIT 1
---
  def confirm_email
    employer = Employer.joins(:email).where(emails:{confirm_token: params[:id]}).first