app/controllers/phone_verify_controller.rb

  def update
    if Time.now > current_employer.phone.pin_sent_at.advance(minutes: 60)
      flash.now[:alert] = "Your pin has expired. Please request another."
      render :new and return
    elsif params[:pin].try(:to_i) == current_employer.phone.pin
      current_employer.phone.update_attribute(:verified, true)
---
UPDATE `phones` SET `verified` = 1, `updated_at` = '2017-03-26 11:32:10' WHERE `phones`.`id` = 1