app/controllers/sessions_controller.rb

  def create
    employer = Employer.joins(:email).where(emails:{email:params[:email]}).first
---
SELECT  `employers`.* FROM `employers` INNER JOIN `emails` ON `emails`.`employer_id` = `employers`.`id` WHERE `emails`.`email` = '8123580776' ORDER BY `employers`.`id` ASC LIMIT 1